function handler(m, { text }) {
  let teks = text ? text : m.quoted && m.quoted.text ? m.quoted.text : m.text
  m.reply(teks.replace(/[ا-ي]/gi, v => {
      return { 
         'ا': 'آ',
        'ب': 'بـًٌٍّ̨̥̬̩ـ',
        'ت': 'تـًٌٍّ̨̥̬̩ـ',
        'ث': 'ثـًٌٍّ̨̥̬̩ـ',
        'ج': 'جـًٌٍّ̨̥̬̩ـ',
        'ح': 'حـًٌٍّ̨̥̬̩ـ',
        'خ': 'خـًٌٍّ̨̥̬̩ـ',
        'د': 'دٍ',
        'ذ': 'ذِ',
        'ر': 'رٍ',
        'ز': 'زٍ',
        'س': 'سـًٌٍّ̨̥̬̩ـ',
        'ش': 'شـًٌٍّ̨̥̬̩ـ',
        'ص': 'صـًٌٍّ̨̥̬̩ـ',
        'ض': 'ضـًٌٍّ̨̥̬̩ـ',
        'ط': 'طـًٌٍّ̨̥̬̩ـ',
        'ظ': 'ظـًٌٍّ̨̥̬̩ـ',
        'ع': 'عـًٌٍّ̨̥̬̩ـ',
        'غ': 'غـًٌٍّ̨̥̬̩ـ',
        'ف': 'فـًٌٍّ̨̥̬̩ـ',
        'ق': 'قـًٌٍّ̨̥̬̩ـ',
        'ك': 'كـًٌٍّ̨̥̬̩ـ',
        'ل': 'لَ',
        'م': 'مـًٌٍّ̨̥̬̩ـ',
        'ن': 'نـًٌٍّ̨̥̬̩ـ',
        'ه': 'ه',
        'ة': 'هّ',
        'و': 'وٌ',
        'ي': 'يـًٌٍّ̨̥̬̩ـ'
      }[v.toLowerCase()] || v
  }))
}
handler.help = ['H O D A']
handler.tags = ['H O D A']
handler.command =  /^(خط-عربي|زخرفه)$/i

export default handler
